WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/specialized/meadow_calc_freq_dc.c
      // Time to capture the first half overflow
      freqDcRtData->LeadToTrailOverFlow = freqDcRtData->LeadToLeadOverFlow;
    
      // This value will be tested when the leading edge arrives
      freqDcRtData->activeState = MEADOW_FREQ_DC_FREQ_DC_SYNC_TRAILING;
      break;

    //------------------------------------------------------------
    case 0x06:    // (illegal) Rising and Falling together, no way
      timStatusReg &= ~GTIM_SR_CC1IF;
      timStatusReg &= ~GTIM_SR_CC2IF;
      freqDcRtData->activeState = MEADOW_FREQ_DC_FREQ_DC_SYNC_ERROR;
      break;

    case 0x07:    // (illegal) Rising and Falling plus UIF
      // This case exists when the duty cycle is very small (< 0.5%) or very
      // large (> 99.5%)
      timStatusReg &= ~GTIM_SR_CC1IF;
      timStatusReg &= ~GTIM_SR_CC2IF;
      timStatusReg &= ~GTIM_SR_UIF;
      freqDcRtData->activeState = MEADOW_FREQ_DC_FREQ_DC_SYNC_ERROR;
      break;

    // There are only 3 bits to check, so this is a not needed. We've checked
    // all possible combinations
    default:
      break;
  }
  // syslog(1, "%s@%d-D06 LED off Exiting ISR\n", __FILE__, __LINE__);
  stm32_gpiowrite(DEBUG_PIN_V2_D06, false);

  // Clear status register as needed
  putreg16(timStatusReg, timerBase + STM32_GTIM_SR_OFFSET);
  return OK;
}

//=============================================================
static uint32_t meadow_calc_freq_dc_get_apb_clock(
          struct freqDcTimerInfo_s *freqDcTimerInfo)
{
  if(freqDcTimerInfo->timerAPBClk)
    return STM32_RCC_APB2ENR;
  else
    return STM32_RCC_APB1ENR;
}

//=============================================================
// Uses the bit-field to determine the Timer clock
static uint32_t meadow_calc_freq_dc_get_max_clock(
          const struct freqDcTimerInfo_s *freqDcTimerInfo)
{
  if(freqDcTimerInfo->timerMaxClk)
    return STM32_APB2_TIM1_CLKIN;
  else
    return STM32_APB1_TIM2_CLKIN;
}

//=============================================================
static void meadow_calc_freq_dc_disable(const uint32_t timerBase)
{
  uint16_t regval = getreg16(timerBase + STM32_BTIM_CR1_OFFSET);
  regval &= ~ATIM_CR1_CEN;
  putreg16(regval, timerBase + STM32_BTIM_CR1_OFFSET);
}

//=============================================================
static void meadow_calc_freq_dc_enable(const uint32_t timerBase)
{
  // Enable timer Counter
  uint16_t cr1Val = getreg16(timerBase + STM32_GTIM_CR1_OFFSET);
  cr1Val |= GTIM_CR1_CEN;
  
  // Re-initialize the counter and generates an update of the registers
  uint16_t egrVal = getreg16(timerBase + STM32_GTIM_EGR_OFFSET);
  egrVal |= GTIM_EGR_UG;

  putreg16(egrVal, timerBase + STM32_GTIM_EGR_OFFSET);
  putreg16(cr1Val, timerBase + STM32_GTIM_CR1_OFFSET);
}

//=====================================================================
// The following function finds the specified timer's built-in information.
// It should only return NULL if the timerNumb is not valid.
struct freqDcTimerInfo_s *meadow_calc_freq_dc_get_timer_info_pointer(const int timerNumb)
{
  for (int offset = 0; offset < MEADOW_FREQ_DC_TOTAL_TIMERS_AVAILABLE; offset++)
  {
    // Find the offset for the timer number
    if(freqTimerInfoArray[offset].timerNumb == timerNumb)
    {
      // Found the offset, return a pointer to the entry
      return ( &(freqTimerInfoArray[offset]));
    }
  }

  return NULL;
}

//=====================================================================
// From the timer number find the correct GPIO table entry
static struct timerGpioInfo_s *meadow_calc_freq_dc_get_timer_gpio_pointer(const int timerNumb)
{
  // Look through all the times and find the matching one 
  for (int offset = 0; offset < MEADOW_FREQ_DC_TOTAL_TIMERS_AVAILABLE; offset++)
  {
    if(freqTimerInfoArray[offset].timerNumb == timerNumb)
    {
      // Found the offset, return a pointer from other array
      return ( &(timerGpioInfoArray[offset]));
    }
  }

  return NULL;
}

//=====================================================================
// This function looks up the correct alternate function of the
// input point for the timer. This is limited to inputs that can be used
static uint32_t meadow_calc_freq_dc_get_af_for_input(const int timerNumb)
{
  // Get the pointer to the GPIO information specified by the timerNumb.
  struct timerGpioInfo_s *timerGpioInfo =
            meadow_calc_freq_dc_get_timer_gpio_pointer(timerNumb);
  
  // The alternate function is Meadow version and input independent
  return timerGpioInfo->timerAltFunc;
}

//=============================================================
// Using the Meadow device version, lookup the GPIO Port and Pin combination.
// Returns channel, either 1-4 or MEADOW_FREQ_DC_BAD_GPIO_VALUE.
static uint32_t meadow_calc_freq_dc_get_ver_based_gpio_chan(const int timerNumb,
          uint8_t portAndPin)
{
  uint32_t chan;

  // Get the pointer to the structure containing all the GPIO information.
  struct timerGpioInfo_s *timerGpioInfo =
            meadow_calc_freq_dc_get_timer_gpio_pointer(timerNumb);

  // Depending on the device version find specified GPIO
  if(meadow_hw_version_get() == MEADOW_F7_HW_VERSION_NUMB_F7V1)
  {
    for(chan = 0; chan < MEADOW_FREQ_DC_MAX_TIMER_CHANNELS; chan++)
    {
      if(timerGpioInfo->timerF7v1Gpio[chan] == portAndPin)
        return chan + 1;
    }
    return MEADOW_FREQ_DC_BAD_GPIO_VALUE;    // Not found
  }
  else if(meadow_hw_version_get() == MEADOW_F7_HW_VERSION_NUMB_F7V2 ||
          meadow_hw_version_get() == MEADOW_F7_HW_VERSION_NUMB_CCMV2)
  {
    for(chan = 0; chan < MEADOW_FREQ_DC_MAX_TIMER_CHANNELS; chan++)
    {
      if(timerGpioInfo->timerF7v2Gpio[chan] == portAndPin)
        return chan + 1;
    }
    return MEADOW_FREQ_DC_BAD_GPIO_VALUE;    // Not found
  }
  else
  {
    return MEADOW_FREQ_DC_BAD_GPIO_VALUE;   // Unknown version
  }
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/
// Called by Meadow.Core to configure
// Timer numbers range from 1 - 14. However, some are not defined because they
// aren't available to Meadow.
int meadow_calc_freq_dc_freq_duty_config(const int timerNumber,
          const uint8_t portAndPin, const uint8_t gpioPolarity)
{
  int ret;
  uint32_t inputGpioConfig;
  static bool firstTime = true;

  if(firstTime)
  {
    firstTime = false;

