WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/specialized/meadow_calc_freq_dc.c
  // Use timer number to find the information to return
  struct freqDcTimerInfo_s *freqDcTimerInfo = 
            meadow_calc_freq_dc_get_timer_info_pointer(returnData->timerNumber);
  if(freqDcTimerInfo == NULL)
  {
    syslog(LOG_ERR, "%s@%d-Timer not configured\n", __FILE__, __LINE__);
    return -ENXIO;      // Unconfigured timer for this feature
  }

  // Is there an object here?
  if(freqDcTimerInfo->freqDcRtData == NULL)
  {
    syslog(LOG_ERR, "%s@%d-No timer assigned\n", __FILE__, __LINE__);
    return -ENODATA;      // No timer initialized
  }

  // Find valid data. This is only an issue at higher frequencies.
  for(validCheckCount = 0;\
      validCheckCount < MEADOW_FREQ_DC_GOOD_DATA_ATTEMPTS;
      validCheckCount++)
  {
    completeCycle  = freqDcTimerInfo->freqDcRtData->countLeadToLead;
    firstHalfCycle = freqDcTimerInfo->freqDcRtData->countLeadToTrail;

    if(completeCycle > 0 && firstHalfCycle > 0)
      break;      // Found valid data, exit

    usleep(1 * 1000);   // delay 1-2 ms waiting for valid data
  }

  if(completeCycle > 0 && firstHalfCycle > 0)
  {
    // Do floating point math for calculations to get better resolution.
    double dutyCycle = (double)(firstHalfCycle * 100.0) / (double)completeCycle;
    double freq = (double)(MEADOW_FREQ_DC_CLOCK_FREQ)/ \
              (double)completeCycle;

    returnData->freqX1000       = (uint32_t)(freq * 1000.0);
    returnData->dutyCycleX1000  = (uint32_t)(dutyCycle * 1000.0);
  }
  else
  {
    // Return 0s as no data available
    returnData->freqX1000       = 0;
    returnData->dutyCycleX1000  = 0;
  }

  // Prevent this count from being reused if there's no input.
  freqDcTimerInfo->freqDcRtData->countLeadToLead   = 0;
  freqDcTimerInfo->freqDcRtData->countLeadToTrail  = 0;

  return OK;
}
#endif    // #if defined(MEADOW_INCLUDE_CALC_FREQ_DC_IN_BUILD)
